## Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [4]:
rates = pd.read_csv('ratings.csv')
rates.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
five_stars = rates[(rates['rating'] == 5.0)]
five_stars.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [6]:
five_stars['movieId'].value_counts().head()

318     153
296     123
356     116
2571    109
260     104
Name: movieId, dtype: int64

In [9]:
movie_names = pd.read_csv('movies.csv')
movie_names.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [10]:
movie_names[movie_names.movieId == 318]

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 годы. Не учитывайте в расчетах отрицательные значения quantity.

In [20]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [21]:
power_baltic = data[ ((data['country'] == 'Estonia') | (data['country'] == 'Lithuania') | (data['country'] == 'Latvia')) & ((data['category'] == 4) | (data['category'] == 12) | (data['category'] == 21)) & ((data['year'] >= 2005) & (data['year'] <= 2010))]
power_baltic.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [22]:
power_baltic['quantity'].sum()

240481.0

## Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

Примеры страниц (необязательно брать именно эти): 

https://fortrader.org/quotes

https://www.finanz.ru/valyuty/v-realnom-vremeni

In [14]:
page_url = 'https://fortrader.org/quotes'
finInf = pd.read_html(page_url)
finInf[0]

                               Type    Last   Chg.  Chg.%  Time
0  Нефть (BRENT) Курс нефти сегодня  58.120 -0.070 -0.120   NaN
1   Нефть (WTI) Цены на нефть (WTI)  52.840  0.060  0.110   NaN
2          Сахар котировки на сахар  12.630  0.000  0.000   NaN
3                   Газ Цена на газ   1.875  0.007  0.375   NaN

In [16]:
type(finInf[0])

pandas.core.frame.DataFrame

In [19]:
finInf[2]

                          Type       Last     Chg.   Chg.%  Time
0      Серебро Цена на серебро    18.0660  -0.0070 -0.0390   NaN
1    Палладий Цена на Палладий  2169.3000  25.4000  1.1800   NaN
2  Золото Цена золота на бирже  1580.3600  -1.2600 -0.0800   NaN
3      Платина Цены на платину   988.9000   2.2000  0.2000   NaN
4      Медь Цена меди на бирже     2.5855  -0.0095 -0.3661   NaN